<?php

/**
 * QuickSDK 游戏同步加解密算法描述
 * @copyright quicksdk 2015
 * @author quicksdk 
 * @version quicksdk v 0.0.1 2014/9/2
 */

echo '<br>';

require('quicksdkAsy.php');


//设置测试值
$_POST['nt_data'] = '@108@119@174@165@158@82@167@152@171@166@161@162@159@115@90@106@94@103@83@85@154@166@156@161@155@160@166@155@118@90@139@141@118@101@110@90@82@165@165@148@167@151@153@159@160@164@157@118@82@165@160@87@116@118@117@165@162@176@165@163@168@166@169@152@157@157@169@171@147@153@150@113@117@160@157@166@164@151@159@158@110@115@166@158@153@118@109@110@102@172@161@152@119@116@162@168@151@161@164@151@160@147@158@152@119@164@169@164@162@167@169@117@95@163@160@156@158@166@152@160@152@164@157@114@117@167@171@173@143@167@168@156@151@164@144@161@168@113@116@98@160@171@172@152@159@169@149@154@167@151@167@161@117@115@167@166@157@157@168@152@158@167@116@104@99@98@97@101@105@100@108@100@98@102@109@106@101@106@100@101@102@105@106@100@111@103@107@103@117@103@165@171@148@157@168@151@160@161@111@111@169@148@177@146@165@159@165@158@110@105@97@102@105@101@106@99@100@103@109@84@106@109@112@108@99@114@103@108@110@97@161@148@178@146@172@156@158@155@118@117@145@164@160@170@163@172@119@98@101@103@105@112@104@153@163@168@165@166@170@118@110@165@165@148@173@168@171@113@97@114@103@172@164@152@165@170@168@118@117@151@175@171@170@149@172@151@166@154@162@153@163@171@112@170@169@171@117@98@157@171@165@168@153@172@143@167@146@167@150@165@172@112@115@102@165@153@172@171@151@160@149@118@114@103@165@157@170@160@168@162@166@166@144@163@157@172@163@152@152@154@115';
$_POST['sign'] = '@104@155@109@158@105@104@104@106@111@103@112@103@148@152@104@158@149@111@101@151@102@111@156@149@155@112@113@105@154@110@108@106';
$_POST['md5Sign'] = '07dae8d71374651c1f0ee4cc16a37f6e';

$md5_key = 'bunr4tme1jc1zudk0iwllpgeqr6rbhpn';
$callback_key = '90782163159998717041368980180119';

//$_POST['nt_data'] = $_GET['nt_data'];
//$_POST['sign'] = $_GET['sign'];
//$_POST['md5Sign'] = $_GET['md5Sign'];

//计算出的签名只
$thisSign = quickAsy::getSign($_POST, $md5_key);

//核对签名
if($thisSign !== $_POST['md5Sign']){
	exit('sign error');
}

//解密xml
$asyContent = quickAsy::decode($_POST['nt_data'], $callback_key);

//解析xml
$xmlObject = simplexml_load_string($asyContent);
$message = $xmlObject->message;


// is_test string 必有 是否为测试订单 1为测试 0为线上正式订单，游戏应根据情况确定上线后是否向测试订单发放道具。
// channel string 必有 渠道标示ID 注意:游戏可根据实情,确定发货时是否校验充值来源渠道是否与该角色注册渠道相符
// channel_uid string 必有 渠道用户唯一标示,该值从客户端GetUserId()中可获取
// game_order string 必有 游戏在调用QucikSDK发起支付时传递的游戏方订单,这里会原样传回
// order_no string 必有 QuickSDK唯一订单号
// pay_time string 必有 支付时间 2015-01-01   23:00:00
// amount string 必有 成交金额，单位元，游戏最终发放道具金额应以此为准
// status string 必有 充值状态 0   成功 1失败(为1时 应返回FAILED失败)
// extras_params string
// 可为空 游戏客户端调用SDK发起支付时填写的透传参数.没有则为空

// 全部设置为字符串
$result = "{ \"is_test\":\"" . $message->is_test . "\"" .
 ",\"channel\":\"" . $message->channel . "\"" .
 ",\"channel_uid\":\"" . $message->channel_uid . "\"" .
 ",\"game_order\":\"" . $message->game_order . "\"" .
 ",\"order_no\":\"" . $message->order_no . "\"" .
 ",\"pay_time\":\"" . $message->pay_time . "\"" .
 ",\"amount\":\"" . $message->amount . "\"" .
 ",\"status\":\"" . $message->status . "\"" .
 ",\"extras_params\":\"" . $message->extras_params . "\"}";

echo $result;

?>